Repository: yamato/perl6doc-jp
Catalog: tm/auto/S02-bits-20140914.tmx
Source language: en_us
Languages: ja

source: Properties applied to objects constructed at compile-time, such as variables and classes, are also called traits.
ja: コンパイル時（例えば変数とクラス）で造られるオブジェクトに適用されるプロパティは、トレイトとも呼ばれている。

source: Traits cannot be changed at run-time.
ja: トレイトは、実行時で変わることができない。

source: Changes to run-time properties are done via mixin instead, so that the compiler can optimize based on declared traits.
ja: 実行時プロパティへの変化はその代わりにミキシンを通してされる、そのため、コンパイラはに基づく宣言されたトレイトを最適化することができる。

source: Types as Constraints
ja: 制約としての型

source: A variable's type is a constraint indicating what sorts of values the variable may contain.
ja: 変数の型は、変数がどんな種類の値を含むかもしれないかについて示している制約である。

source: More precisely, it's a promise that the object or objects contained in the variable are capable of responding to the methods of the indicated &quot;role&quot;.
ja: より正確に、変数に含まれるオブジェクトまたはオブジェクトが示された「ロール」のメソッドに反応することができることは、約束である。

source: See S12 for more about roles.
ja: ロールについてより多くについてはS12を見なさい。

source: Container Types
ja: コンテナ型

source: A variable may itself be bound to a container type that specifies how the container works, without specifying what kinds of things it contains.
ja: それがどんな種類のものを含むか指定することなく、変数はそれ自体コンテナがどのように動くかについて指定するコンテナ型の束縛を受ける場合がある。

source: Constraints and container types can be used together:
ja: 制約とコンテナ型が、一緒に使われることができる：

source: Note that $x is also initialized to the Int type object.
ja: $xがIntタイプオブジェクトにも初期化されることに注意すべきである。

source: See below for more on this.
ja: これの詳細について下記を見なさい。

source: There is a special value named Nil.
ja: Nilという名前をつけられる特殊値が、ある。

source: It means &quot;there is no value here&quot;.
ja: それは、「値が、ここにない」ことを意味する。

source: It is a little bit like the empty () list, insofar as both represent an absence of values, except that () is defined and means &quot;there are 0 arguments here if you're counting that low&quot;.
ja: 両方とも値の欠如を表現する限り、それは少し空の()リストのようであるが、()は定義される、そして、あなたが低くそれを数えているならば、そこの手段はここの0の引数である。

source: The Nil value represents the absence of a value where there should be one, so it does not disappear in list context, but relies on something downstream to catch it or blow up.
ja: Nil値は人がいなければならない値の欠如を表現するので、それはリストコンテキストで消えなくて、それを捕えるか、爆発するために下流の何かに頼る。

source: Nil also indicates a failed match.
ja: Nilも、失敗したマッチを示す。

source: Since method calls are performed directly on any object, Nil can respond to certain method calls.
ja: メソッド呼び出しが何かオブジェクトで直接実行される時から、Nilは特定のメソッド呼び出しに応じることができる。

source: Nil.defined returns False (whereas ().defined returns True).
ja: Nil.defined収益False（ところが、().defined収益True）。

source: Nil.so also returns False.
ja: Nil.soも、Falseを返る。

source: Nil.ACCEPTS always returns Nil.
ja: Nil.ACCEPTSは、常にNilを返る。

source: Nil.perl and Nil.gist return 'Nil'.
ja: Nil.perlとNil.gistは、'Nil'を返る。

source: Nil.Stringy and Nil.Str throw a resumable warning that returns a value of '' on resumption.
ja: Nil.StringyとNil.Strは、再開に関して''の値を返るresumableな警告を投げる。

source: Nil.Numeric likewise throws a resumable warning that returns 0 on resumption.
ja: Nil.Numericは、resumableな警告に再開のその収益0を同様に投げる。

source: Any undefined method call on Nil returns Nil, so that Nil propagates down method call chains.
ja: Nilの上の何か未定義メソッド呼び出しはNilを返る、そのため、Nilは下のメソッド呼び出しチェーンを伝達する。

source: Likewise any subscripting operation on Nil returns Nil.
ja: 同様に、Nilの上の何か添え字付け演算は、Nilを返る。

source: Assigning Nil to any scalar container causes the container to throw out any contents and restore itself to an uninitialized state (after which it will appear to contain an object appropriate to the declared default of the container, where Any is the default default;
ja: Nilを何かスカラーコンテナに割り当てることは、コンテナが何か内容を投げ出して、それ自体を初期化されていない州に戻す原因になる（コンテナ（Anyはデフォルトデフォルトである）の宣言されたデフォルトにオブジェクト適正を含むことがどれのように見えるか;

source: the element may be simply deleted if that's how the default can be represented in the structure).
ja: それがデフォルトが構造で表現されることができる方法であるならば、要素は単にアンインストール済みである場合がある）。

source: Binding of Nil with := simply puts Nil in the container.
ja: :=によるNilのバインディングは、単にNilをコンテナに入れる。

source: However, binding Nil to a parameter (::= semantics) works more like assignment;
ja: しかし、パラメータ（::=意味論）へのバインディングNilは、割当てのようにより動く;

source: passing Nil to a parameter with a default causes that parameter to be set to its default value rather than an undefined value, as if the argument had not been supplied.
ja: まるで引数が供給されなかったように、デフォルトによるパラメータへの一時的なNilはそのパラメータが未定義値よりもむしろそのデフォルト値に設定される原因になる。

source: Assigning Nil to any entire composite container (such as an Array or Hash) empties the container, resetting it back to an uninitialized state.
ja: Nilを何か全ての複合コンテナ（例えばArrayまたはHash）に割り当てることはコンテナを空にする。そして、初期化されていない州へそれをリセットする。

source: The container object itself then becomes undefined.
ja: それから、コンテナオブジェクトそのものは、未定義になる。

source: (Assignment of () leaves it defined.)
ja: （()の割当てはそれを定義されるままにしておく。）

source: Type Objects
ja: 型オブジェクト

source: my Dog $spot by itself does not automatically call a Dog constructor.
ja: my Dog $spotは、Dogコンストラクタを単独で自動的に呼ばない。

source: It merely assigns an undefined Dog prototype object to $spot:
ja: それは、単に未定義Dogプロトタイプオブジェクトを$spotに割り当てるだけである：

source: Any type name used as a value is the undefined prototype object of that type, or type object for short.
ja: 値として使われる任意型名は、その型の未定義プロトタイプオブジェクトまたは略して型オブジェクトである。

source: See S12 for more on that.
ja: それの詳細についてS12を見なさい。

source: Any type name in rvalue context is parsed as a single type value and expects no arguments following it.
ja: rvalue前後関係の任意型名は、シングル式値として解析されて、それの後、引数を予想しない。

source: However, a type object responds to the function call interface, so you may use the name of a type with parentheses as if it were a function, and any argument supplied to the call is coerced to the type indicated by the type object.
ja: しかし、型オブジェクトは関数呼出しインタフェースに反応するので、まるでそれが関数であるように、あなたは括弧で型の名前を使用するかもしれない、そして、呼び出しに供給される何か引数は型オブジェクトによって示される型に強制される。

source: If there is no argument in the parentheses, the type object returns itself:
ja: 引数が括弧でないならば、型オブジェクトはそれ自体返る：

source: To get a real Dog object, call a constructor method such as new:
ja: 本当のDogオブジェクトを得て、newのようなコンストラクタメソッドを呼ぶこと：

source: You can pass in arguments to the constructor as well:
ja: あなたは、同様にコンストラクタに引数を渡すことができる：

source: Just like &quot;Nil&quot;, type objects do not disappear in list context, but rely on something downstream to catch it or blow up.
ja: ちょうど&quot;Nil&quot;のように、型オブジェクトはリストコンテキストで消えなくて、それを捕えるか、爆発するために、下流の何かに頼る。

source: This allows type objects to be assigned to scalars, but to disappear in non-scalar contexts.
ja: これは、型オブジェクトがスカラーに割り当てられるが、非スカラーコンテキストで消えるのを許可する。

source: Coercive type declarations
ja: 強制的な型宣言

source: The parenthesized form of type coercion may be used in declarations where it makes sense to accept a wider set of types but coerce them to a narrow type.
ja: 型強制の括弧に入れられた形が、型のより広いセットを受け入れるが、狭い型にそれらを強制することが意味をなす宣言において使われるかもしれない。

source: (This only works for one-way coercion, so you may not declare any rw parameter with a coercive type.) The type outside the parens indicates the desired end result, and subsequent code may depend on it being that type.
ja: 括弧の外の型は望ましい結果を示す（これは一方向だけの強制のために動くだけであるので、何も強制的な型によるrwパラメータと宣言しなくてもよい。）、そして、以降のコードはそれの上でその型であること次第かもしれない。

source: The type inside the parens indicates the acceptable set of types that are allowed to be bound or assigned to this location via coercion.
ja: 括弧の中の型は、結びつけられるか、強制を通してこの場所に割り当てさせられておかれる型の許容できるセットを示す。

source: If the wide type is omitted, Any is assumed.
ja: 広い型が省略されるならば、Anyは装われる。

source: In any case, the wide type is only indicative of permission to coerce;
ja: いずれにせよ、広い型は、強制する許可を示すだけである;

source: there must still be an available coercion routine from the wide type to the narrow type to actually perform the coercion.
ja: 利用できる強制ルーチンが、実際に強制を実行するために、まだ広い型から狭い型までなければならない。

source: Coercions may also be specified on the return type:
ja: コアーションは、戻り型の上で指定されもするかもしれない：

source: Containers of Native Types
ja: ネイティブ型のコンテナ

source: If you say
ja: あなたが言うならば、

source: you are declaring that the elements of @array are native integers, but that the array itself is implemented by the MyArray class.
ja: あなたは、@arrayの要素がネイティブ整数である、しかし、配列自体がMyArrayクラスによって実装されると断言している。

source: Untyped arrays and hashes are still perfectly acceptable, but have the same performance issues they have in Perl 5.
ja: Untyped配列とハッシュには、まだ完全に許容できるが、それらにはPerl 5である同じ性能の問題がある。

source: Methods on Arrays
ja: 配列の上のメソッド

source: To get the number of elements in an array, use the .elems method.
ja: 配列で要素数を得るために、.elemsメソッドを使用しなさい。

source: You can also ask for the total string length of an array's elements, in codepoints or graphemes, using these methods, .codes or .graphs respectively on the array.
ja: コードポイントまたは書記素で、あなたは配列の要素の総ストリング長を求めることもできる。そして、配列の上でそれぞれこれらのメソッド、.codesまたは.graphsを使う。

source: The same methods apply to strings as well.
ja: 同法は、同様に文字列にあてはまる。

source: (Note that .codes is not well-defined unless you know which canonicalization is in effect.
ja: （あなたがどの標準化が活動中かについてわからない限り、.codesがはっきりしていないことに注意すべきである。

source: Hence, it allows an optional argument to specify the meaning exactly if it cannot be known from context.)
ja: それゆえに、必ずしも前後関係からはわかることができないならば、それは任意の引数を意味を指定させる。）

source: There is no .length method for either arrays or strings, because length does not specify a unit.
ja: lengthが単位を指定しないので、.lengthメソッドがどちらの配列または文字列のためにもない。

source: Built-in Type Conventions
ja: 組込み型規則

source: Built-in object types start with an uppercase letter.
ja: ビルトインオブジェクトタイプは、大文字から始める。

source: This includes immutable types (e.g. Int, Num, Complex, Rat, Str, Bit, Regex, Set, Block, Iterator), as well as mutable (container) types, such as Scalar, Array, Hash, Buf, Routine, Module, and non-instantiable Roles such as Callable and Integral.
ja: これは、不変の型（例えばInt、Num、Complex、Rat、Str、Bit、Regex、Set、Block、Iterator）ならびに変わりやすい（コンテナ）型（例えばScalar、Array、Hash、Buf、Routine、Moduleと非instantiableなロール（例えばCallableとIntegral））を含む。

source: Non-object (native) types are lowercase:
ja: 型がそうである非オブジェクト（ネイティブ）は、以下を小文字にする：

source: Native types are primarily intended for declaring compact array storage, that is, a sequence of storage locations of the specified type laid out in memory contiguously without pointer indirection.
ja: ネイティブ型は、主にコンパクトな配列記憶領域（つまり、ポインター間接的行動なしで隣接してメモリで配置される指定された型の一連の記憶場所）を宣言することを意図される。

source: However, Perl will try to make those look like their corresponding uppercase types if you treat them that way.
ja: しかし、あなたがそのようにそれらを扱うならば、Perlはそれらを彼らの対応する大文字の型のように見えさせようとする。

source: (In other words, it does autoboxing and autounboxing as necessary.
ja: （言い換えると、それは、autoboxingして、必要に応じてautounboxingすることをする。

source: Note, however, that repeated autoboxing and unboxing can make your program much slower, compared to a program that makes consistent use of either native types or object types.)
ja: なお、しかし、それはautoboxingすることを繰り返した、そして、ネイティブ型かオブジェクトタイプを一貫して利用するプログラムと比較して、箱から出すことはあなたのプログラムを非常により遅くすることができる。）

source: The .WHICH Method for Value Types
ja: 値型のための.WHICHメソッド

source: Some object types can behave as value types.
ja: 若干のオブジェクトタイプは、値型としてふるまうことができる。

source: Every object can produce a &quot;WHICH&quot; value that uniquely identifies the object for hashing and other value-based comparisons.
ja: すべてのオブジェクトは、ハッシュと他の値ベースの比較のためにオブジェクトをユニークに識別する&quot;WHICH&quot;値を生じることができる。

source: Normal objects just use their location as their identity, but if a class wishes to behave as a value type, it can define a .WHICH method that makes different objects look like the same object if they happen to have the same contents.
ja: 通常のオブジェクトはちょうど彼らのアイデンティティとして彼らの場所を使う、しかし、クラスが値型としてふるまうことを望むならば、それはそれらが偶然同じ内容を持っていることが起こるならば、異なるオブジェクトを同じオブジェクトのように見えさせる.WHICHメソッドを定義することができる。

source: The ObjAt Type
ja: ObjAt型

source: When we say that a normal object uses its location as its identity, we do not mean that it returns its address as a number.
ja: 通常のオブジェクトがそのアイデンティティとしてその場所を使うと言うとき、我々はそれが数としてアドレスを返ると言っていない。

source: In the first place, not all objects are in the same memory space (see the literature on NUMA, for instance), and two objects should not accidentally have the same identity merely because they were stored at the same offset in two different memory spaces.
ja: 第一に、すべてのオブジェクトが同じメモリ空間（たとえば、NUMAについての文献を見る）にあるというわけではない、そして、単にそれらが2つの異なるメモリ空間に同じオフセットで保存されたのでだけ、2つのオブジェクトには同じアイデンティティが偶然にあってはならない。

source: We also do not want to allow accidental identity collisions with values that really are numbers (or strings, or any other mundane value type).
ja: 我々も、本当に数（または文字列または少しも他のありふれた値型）である値との偶発的なアイデンティティ衝突を許したくない。

source: Nor should we be encouraging people to think of object locations that way in any case.
ja: そして、我々は人々がいずれにせよそのようにオブジェクト場所について考えるのを奨励していてはならない。

source: So WHICH still returns a value rather than another object, but that value must be of a special ObjAt type that prevents accidental confusion with normal value types, and at least discourages trivial pointer arithmetic.
ja: WHICHがまだ返るように、もう一つのオブジェクトよりもむしろ値はその値以外の通常の値型の偶然の混同を防ぐ特別なObjAt型でなければならなくて、少なくとも取るに足らないポインターの算術演算をはばむ。

source: Certainly, it is difficult to give a unique name to every possible address space, let alone every possible address within every such a space.
ja: 確かに、それはすべてのあり得るアドレス空間に固有の名に与えるのが難しくて、される単独であり得るアドレスそのようなすべてのスペース。

source: In the absence of a universal naming scheme, it can only be made improbable that two addresses from two different spaces will collide.
ja: 一般的な命名スキームがない場合、2つの異なるスペースからの2アドレスが衝突することは、ありそうもなくなることができるだけである。

source: A sufficiently large random number may represent the current address space on output of an ObjAt to a different address space, or if serialized to YAML or XML.
ja: 異なるアドレス空間にとって、または、YAMLまたはXMLに順番に並べられるならば、十分に大きな乱数はObjAtの出力の上で現在のアドレス空間を表現するかもしれない。

source: (This extra identity component need not be output for debugging messages that assume the current address space, since it will be the same big number consistently, unless your process really is running under a NUMA.)
ja: （それが一貫して同じ大きい数である時から、この余分の単位元成分はあなたのプロセスがNUMAの下で本当に動作しない限り、現在のアドレス空間を引き受けるメッセージをデバッグするための出力である必要はない。）

source: Alternately, if an object is being serialized to a form that does not preserve object identity, there is no requirement to preserve uniqueness, since in this case the object is really being translated to a value type representation, and reconstituted on the other end as a different unique object.
ja: あるいは、オブジェクトがオブジェクト識別性を保たない形に順番に並べられているならば、本例でオブジェクトが本当に値タイプ代表に変形されていて、異なる独特のオブジェクトとして反対側で再構成されている時から、ユニークさを保存する必要性がない。

source: Variables Containing Undefined Values
ja: 未定義値を含んでいる変数

source: A variable with a non-native type constraint may contain an undefined value such as a type object, provided the undefined value meets the type constraint.
ja: 未定義値が型制約に直面するならば、ネイティブでない型制約による変数は型オブジェクトのような未定義値を含むかもしれない。

source: Variables with native types do not support undefinedness:
ja: ネイティブ型による変数は、未定義をサポートしない：

source: it is an error to assign an undefined value to them:
ja: 未定義値をそれらに割り当てることは、エラーである：

source: Since num can support the value NaN but not the general concept of undefinedness, you can coerce an undefined value like this:
ja: numが未定義の一般概念でなく値NaNをサポートすることができるので、あなたはこのように未定義値を強制することができる：

source: Variables of non-native types start out containing a type object of the appropriate type unless explicitly initialized to a defined value.
ja: はっきりと定義済み値に初期化されない限り、ネイティブでない型の変数は適正型の型オブジェクトを含んで始める。

source: Any container's default may be overridden by the is default(VALUE) trait.
ja: 何かコンテナのデフォルトは、is default(VALUE)トレイトによってオーバーライドされるかもしれない。

source: If the container's contents are deleted, the value is notionally set to the provided default value;
ja: コンテナの内容がアンインストール済みであるならば、値は提供されたデフォルト値に抽象的にセットされる;

source: this value may or may not be physically represented in memory, depending on the implementation of the container.
ja: コンテナの実装に従い、この値は、メモリで物理的に表現されるかもしれないか、表現されないかもしれない。

source: You should officially not care about that (much).
ja: あなたは、それ（非常に）が公式に好きであるべきでない。

source: The HOW Method
ja: HOWメソッド

source: Every object supports a HOW function/method that returns the metaclass instance managing it, regardless of whether the object is defined:
ja: オブジェクトが定義されるか否かを問わず、すべてのオブジェクトはそれを管理しているメタクラスインスタンスを返るHOW関数/メソッドをサポートする：

source: (For a prototype system (a non-class-based object system), all objects are merely managed by the same meta object.)
ja: （プロトタイプシステム（非クラスベースオブジェクトシステム）については、すべてのオブジェクトは単に同じメタオブジェクトによって管理されるだけである。）

source: Roles
ja: ロール

source: Perl supports generic types through what are called &quot;roles&quot; which represent capabilities or interfaces.
ja: Perlは、機能またはインターフェースを表現する「ロール」と呼ばれていることを通して、汎用的な型をサポートする。

source: These roles are generally not used directly as object types.
ja: これらのロールが、通常、オブジェクトタイプとして直接使われない。

source: For instance all the numeric types perform the Numeric role, and all string types perform the Stringy role, but there's no such thing as a &quot;Numeric&quot; object, since these are generic types that must be instantiated with extra arguments to produce normal object types.
ja: たとえば、すべての数値型はNumericロールを実行する、そして、すべての文字列型はStringyロールを実行する、しかし、これらが通常のオブジェクトタイプを生じるために余分の引数で具体例をあげて示されなければならない汎用的な型である時から、&quot;Numeric&quot;オブジェクトなんてものがない。

source: Common roles include:
ja: 一般のロールは以下を含む：

source: Numeric Types
ja: Numeric型

source: Perl 6 intrinsically supports big integers and rationals through its system of type declarations.
ja: Perl 6は、型宣言のそのシステムによって、大きい整数と有理数を本質的にサポートする。

source: Int automatically supports promotion to arbitrary precision, as well as holding Inf and NaN values. Note that Int assumes 2's complement arithmetic, so +^1 == -2 is guaranteed.
ja: Intは随意精度（現状維持のInfとNaN値だけでなく）に昇進を自動的にサポートする。Intが2の補数を算数とみなすことに注意すべきであるので、+^1 == -2は保証される。

source: (Native int operations need not support this on machines that are not natively 2's complement.
ja: （ネイティブint演算は、最適化されて2の補数でない機械で、これをサポートする必要はない。

source: You must convert to and from Int to do portable bitops on such ancient hardware.)
ja: あなたは、そのような古代のハードウェアの上で携帯型ビット演算をするために、Intへ／から変わらなければならない。）

source: Num must support the largest native floating point format that runs at full speed.
ja: Numは、フルスピードで走る最大のネイティブ浮動小数点フォーマットをサポートしなければならない。

source: It may be bound to an arbitrary precision type, but by default it is the same type as a native num.
ja: それは随意精度型の束縛を受ける場合がある、しかし、デフォルトで、それはネイティブnumと同じ型である。

source: See below.
ja: 下記参照。

source: Rat supports extended precision rational arithmetic.
ja: Ratは、拡張精度有理数演算をサポートする。

source: Dividing two Integral objects using infix:&lt;/&gt; produces a Rat, which is generally usable anywhere a Num is usable, but may also be explicitly cast to Num.
ja: 2つのIntegralを分けることはinfix:&lt;/&gt;を使うことがRatを生じると反対する、通常、どこでも使える。そして、Numは使えるが、Numにもはっきりと投げられるかもしれない。

source: (Also, if either side is Num already, infix:&lt;/&gt; gives you a Num instead of a Rat.)
ja: （また、どちらの側でもすでにNumであるならば、infix:&lt;/&gt;はRatの代わりにあなたにNumを与える。）

source: Rat and Num both do the Real role.
ja: RatとNumは、Realロールを両方ともする。

source: Lowercase types like int and num imply the native machine representation for integers and floating-point numbers, respectively, and do not promote to arbitrary precision, though larger representations are always allowed for temporary values.
ja: 小文字の型はintに合う、そして、より大きな表現が常にテンポラリー値のために許されるけれども、numは、それぞれ、整数と浮動小数点数のために在来マシン代表を意味して、随意精度に昇進させない。

source: Unless qualified with a number of bits, int and num types represent the largest native integer and floating-point types that run at full speed.
ja: いくつかのビットで制限されない限り、intとnum型は最大のネイティブ整数を表現する、そして、浮動小数点はフルスピードでその実行を入力する。

source: Because temporary values are biased in favor of correct semantics over compact storage, native numeric operators that might overflow must come in two variants, one which returns a guaranteed correct boxed value, and one of which returns a guaranteed fast native value.
ja: テンポラリー値が集密書庫の上に正しい意味論に賛成して偏るので、あふれるかもしれないネイティブ算術演算子は2つの変形、保証された正しい箱入り値を返るものと保証された速いネイティブ値が返る一つで来なければならない。

source: By default the boxing variant is selected (probably by virtue of hiding the native variants), but within a given lexical scope, the use native pragma will allow use of the dangerous but fast variants instead.
ja: デフォルトで、ボクシング変形は選ばれる（おそらくネイティブ変形を隠すことによって）、しかし、所定のレキシカルスコープの中で、use nativeプラグマはその代わりに危険であるが、速い変形の使用を許す。

source: Arguments to the pragma can be more specific about what types of return values are allowed, e.g. use native 'int'; and such.
ja: プラグマへの引数は、どんな型の戻り値が許されるか（例えばuse native 'int'; その他）について、よりはっきりしていることがありえる。

source: (The optimizer is also allowed to substitute such variants when it can determine that the final destination would store natively in any case, or that the variant could not possibly malfunction given the arguments.) [Conjecture: we could allow an 'N' metoperator to select the native variant on a case by case basis.]
ja: （オプティマイザーはそれが最終仕向け地がいずれにせよ最適化されて保存する、または、変形が引数を与えられておそらく故障することができなかったと決定することができるそのような変形を代えるのも許される。）［推測する：我々は'N'メタ演算子にケースの基礎によってケースに関してネイティブ変形を選ばせておくことができた。］

source: Numeric values in untyped variables use Int and Num semantics rather than int and num.
ja: untypedされた変数の数値は、intとnumよりもむしろIntとNum意味論を使う。

source: Literals, on the other hand, may default to native storage formats if they reasonably can.
ja: それらが合理的にそうすることができるならば、リテラルは、他方、ネイティブ記憶領域フォーマットにデフォルトでなるかもしれない。

source: We rely on the semantics of boxing temporary values by default (see above) to maintain correct semantics;
ja: 我々は、正しい意味論を維持するために、デフォルトでボクシングテンポラリー値の意味論に頼る（上記参照）;

source: the optimizer is of course allowed to box or unbox a literal at compile time (or cache a boxed/unboxed version of the value) whenever it seems appropriate.
ja: それが適正のようなときはいつでも、オプティマイザーはボクシングをするか、コンパイル時（または、値の箱入り/箱から出されたバージョンを貯蔵する）でリテラルを箱から出すのをもちろん許される。

source: In any case, native literals should be preferred under use native semantics.
ja: いずれにせよ、ネイティブリテラルは、use native意味論の下で好まれなければならない。

source: For pragmatic reasons, Rat values are guaranteed to be exact only up to a certain point.
ja: 実際的な理由で、値が確信してだけまで厳密に言えば、保証されるRatは、ポイントする。

source: By default, this is the precision that would be represented by the Rat64 type, which is an alias for Rational[Int,Uint64], which has a numerator of Int but is limited to a denominator of Uint64 (which may or may not be implemented as a native uint64, since small representations may be desirable for small denominators).
ja: デフォルトで、これはRat64型によって表現される精度である。そして、それはRational[Int,Uint64]の別名である。そして、それはIntの分子を持つが、Uint64（小さな表現が少ない分母のために望ましい時から、ネイティブuint64として実装されるかもしれないか、実装されないかもしれない）の分母に限られている。

source: A Rat64 that would require more than 64 bits of storage in the denominator is automatically converted either to a Num or to a lesser-precision Rat, at the discretion of the implementation.
ja: 実装の意のままで、分母で64ビット以上の記憶領域を必要とするRat64は、Numに、または、より小さい精度Ratに自動的に変わる。

source: (Native types such as rat64 limit the size of both numerator and denominator, though not to the same size.
ja: （同じサイズにないけれども、rat64のようなネイティブ型は分子と分母のサイズを制限する。

source: The numerator should in general be twice the size of the denominator to support user expectations.
ja: 分子は、一般にユーザー予想をサポートする分母のサイズの2倍でなければならない。

source: For instance, a rat8 actually supports Rational[int16,uint8], allowing numbers like 100.01 to be represented, and a rat64, defined as Rational[int128,uint64], can hold the number of seconds since the Big Bang with attosecond precision.
ja: たとえば、100.01のような数を表現させられて、rat8はRational[int16,uint8]を実際にサポートする、そして、rat64（Rational[int128,uint64]と定義される）はアト秒精度でビッグバンから秒数を持つことができる。

source: Though perhaps not with attosecond accuracy...)
ja: アト秒精度でおそらくないけれども、...）

source: The limitation on Rat values is intended to be enforced only on user-visible types.
ja: Rat値に対する制限は、ユーザー見える型だけに強制されることを意図される。

source: Intermediate values used in the internal calculations of Rat operators may exceed this precision, or represent negative denominators.
ja: Rat演算子の内部の計算において使われる中間の値は、この精度を超えるかもしれないか、否定的な分母を表現するかもしれない。
